# Brewfile — restore all packages with: brew bundle
# Add new packages here as you install them.

# Taps
tap "nikitabobko/tap"     # AeroSpace window manager
tap "oven-sh/bun"         # Bun JS runtime

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"

# Core CLI replacements
brew "eza"          # ls replacement
brew "bat"          # cat replacement
brew "fd"           # find replacement
brew "ripgrep"      # grep replacement (rg)
brew "delta"        # diff pager for git
brew "dust"         # du replacement
brew "duf"          # df replacement
brew "procs"        # ps replacement
brew "bottom"       # top replacement (btm)
brew "sd"           # sed replacement

# Navigation & search
brew "fzf"          # fuzzy finder
brew "zoxide"       # smart cd

# Shell
brew "starship"     # prompt
brew "atuin"        # shell history (SQLite, cross-machine sync)
brew "antidote"     # zsh plugin manager
brew "direnv"       # per-directory env vars

# Git
brew "git"
brew "lazygit"      # terminal UI for git
brew "gh"           # GitHub CLI
brew "git-filter-repo"  # rewrite git history

# Multiplexer
brew "tmux"

# Editor
brew "neovim"

# Runtime manager
brew "mise"         # replaces nvm + pyenv + rbenv

# Package managers
brew "oven-sh/bun/bun"  # bun — replaces npm
brew "uv"               # uv — replaces pip

# Dotfile manager
brew "chezmoi"

# Utilities
brew "tree"
brew "jq"
brew "yq"
brew "wget"
brew "watch"
brew "tldr"

# Apps
cask "nikitabobko/tap/aerospace"  # tiling window manager
cask "git-credential-manager"  # Git auth
