# Brewfile — restore all packages with: brew bundle
# Add new packages here as you install them.

# Taps
tap "nikitabobko/tap"     # AeroSpace window manager
tap "oven-sh/bun"         # Bun JS runtime

# Fonts
cask "font-jetbrains-mono-nerd-font"   # primary terminal font (ligatures + icons)
cask "font-symbols-only-nerd-font"     # icon fallback for non-ASCII glyphs

# Core CLI replacements
brew "eza"          # ls replacement
brew "bat"          # cat replacement
brew "fd"           # find replacement
brew "ripgrep"      # grep replacement (rg)
brew "delta"        # diff pager for git
brew "dust"         # du replacement
brew "duf"          # df replacement
brew "procs"        # ps replacement
brew "bottom"       # top replacement (btm)
brew "sd"           # sed replacement

# Navigation & search
brew "fzf"          # fuzzy finder
brew "zoxide"       # smart cd

# Shell
brew "starship"     # prompt
brew "atuin"        # shell history (SQLite, fuzzy search, local-only)
brew "antidote"     # zsh plugin manager
brew "direnv"       # per-directory env vars

# Git
brew "git"              # version control
brew "lazygit"          # terminal UI for git (stage, commit, rebase visually)
brew "gh"               # GitHub CLI (PRs, issues, CI from terminal)
brew "git-filter-repo"  # rewrite git history

# Multiplexer
brew "tmux"             # terminal multiplexer (sessions, panes, persists)

# Editor
brew "neovim"           # text editor (LazyVim distro, LSP, full IDE)

# Runtime manager
brew "mise"         # replaces nvm + pyenv + rbenv

# Package managers
brew "oven-sh/bun/bun"  # bun — replaces npm
brew "uv"               # uv — replaces pip

# Dotfile manager
brew "chezmoi"          # dotfile manager (git-backed, cross-machine sync)

# Utilities
brew "tree"             # directory tree listing
brew "jq"               # JSON processor (query, filter, transform)
brew "yq"               # YAML processor (like jq for YAML)
brew "wget"             # file downloader
brew "watch"            # repeat a command on interval
brew "tldr"             # concise command cheat sheets
brew "glow"             # markdown renderer

# Containers
brew "container"        # Apple's lightweight Linux container runtime (no daemon, Apple Silicon)

# Apps
cask "nikitabobko/tap/aerospace"  # i3-style tiling window manager (Alt-hjkl)
cask "git-credential-manager"     # Git auth (stores creds in macOS Keychain)
